Repository: infernotlc/brightway
Catalog: lib/l10n/app_*.arb
Languages: tr

source: Start Point
tr: Başlangıç Noktası

source: End Point
tr: Bitiş Noktası

source: Calculate Path
tr: Yol Hesapla

source: Path Found
tr: Yol Bulundu

source: No path available
tr: Yol bulunamadı

source: Calculating path...
tr: Yol hesaplanıyor...

# pathSteps
source: Path: {steps} steps
tr: Yol: {steps} adım

source: Navigation Instructions
tr: Navigasyon Talimatları

# startFacing
source: Start facing {direction}
tr: {direction} yönüne dönerek başlayın

source: Turn left
tr: Sola dönün

source: Turn right
tr: Sağa dönün

source: Turn around
tr: Geri dönün

source: Go straight
tr: Düz gidin

# takeStep
source: Take 1 step forward
tr: 1 adım ileri gidin

# takeStepToDestination
source: Take 1 step forward to reach {destination}
tr: {destination} konumuna ulaşmak için 1 adım ileri gidin

# youHaveArrived
source: You have arrived at {destination}
tr: {destination} konumuna ulaştınız

# startingFrom
source: Starting from {start}, face {direction}
tr: {start} konumundan başlayarak {direction} yönüne dönün

# walkForward
source: Walk forward one step
tr: Bir adım ileri yürüyün

# walkForwardToDestination
source: Walk forward one step to reach {destination}
tr: {destination} konumuna ulaşmak için bir adım ileri yürüyün

# directionNorth
source: north
tr: kuzey

# directionSouth
source: south
tr: güney

# directionLeft
source: left
tr: sol

# directionRight
source: right
tr: sağ

# pathfindingStartingAlgorithm
source: Starting A* algorithm from {start} to {end}
tr: A* algoritması {start} konumundan {end} konumuna başlatılıyor

# pathfindingGridSize
source: Grid size: {rows}x{cols}
tr: Izgara boyutu: {rows}x{cols}

# pathfindingPathFound
source: Path found after {iterations} iterations
tr: Yol {iterations} iterasyonda bulundu

# pathfindingPathCalculated
source: Path calculated: {steps} steps
tr: Yol hesaplandı: {steps} adım

# pathfindingNoPathFound
source: No path found after {iterations} iterations
tr: {iterations} iterasyonda yol bulunamadı

# gridLegend
source: Legend: [D] = Walkable (doors), [X] = Obstacle (blocks movement), [ ] = Empty space
tr: Açıklama: [D] = Yürünebilir (kapılar), [X] = Engel (hareketi engeller), [ ] = Boş alan

# gridNote
source: Note: All items can be destinations, but only doors allow movement through them
tr: Not: Tüm öğeler hedef olabilir, ancak sadece kapılar hareket etmeye izin verir

# gridRow
source: Row {row}
tr: Satır {row}

# itemToilet
source: Toilet
tr: Tuvalet

# itemTable
source: Table
tr: Masa

# itemChair
source: Chair
tr: Sandalye

# itemDoor
source: Door
tr: Kapı

# itemExitDoor
source: Exit Door
tr: Çıkış Kapısı

# itemWall
source: Wall
tr: Duvar

# itemObstacle
source: Obstacle
tr: Engel

# errorPathCalculation
source: Error calculating path: {error}
tr: Yol hesaplanırken hata: {error}

# errorTTSFailed
source: Text-to-speech failed: {error}
tr: Metin-konuşma başarısız: {error}

# userWelcome
source: Welcome!
tr: Hoş Geldiniz!

source: User Panel
tr: Kullanıcı Paneli

source: Places
tr: Mekanlar

# placesSubtitle
source: Discover available places
tr: Mevcut mekanları keşfedin

source: Settings
tr: Ayarlar

# settingsSubtitle
source: App settings
tr: Uygulama ayarları

# settingsTitle
source: Settings
tr: Ayarlar

source: Language Selection
tr: Dil Seçimi

# languageSection
source: Language
tr: Dil

source: Cancel
tr: İptal

source: Apply
tr: Uygula

source: Apply Changes
tr: Değişiklikleri Uygula

# languageChangeInfo
source: Language changes will affect both the app interface and text-to-speech. The app will restart to apply the new language.
tr: Dil değişiklikleri hem uygulama arayüzünü hem de metin-konuşma özelliğini etkileyecektir. Yeni dil uygulanmak için uygulama yeniden başlatılacaktır.

source: Available Places
tr: Mevcut Mekanlar

source: Discover Amazing Places!
tr: Harika Mekanları Keşfedin!

# browseDesignsDescription
source: Browse designs created by our community admins
tr: Topluluk yöneticilerimiz tarafından oluşturulan tasarımları keşfedin

source: Available Designs
tr: Mevcut Tasarımlar

# designsCount
source: {count} designs
tr: {count} tasarım

source: No Designs Available
tr: Tasarım Bulunamadı

# noDesignsDescription
source: Admins haven't created any designs yet. Check back later!
tr: Yöneticiler henüz tasarım oluşturmadı. Daha sonra tekrar kontrol edin!

# createdBy
source: Created by: {adminName}
tr: Oluşturan: {adminName}

# itemsCount
source: {count} items
tr: {count} öğe

# createdOn
source: Created {date}
tr: Oluşturulma: {date}

source: Select Start Point
tr: Başlangıç Noktası Seç

source: Select End Point
tr: Bitiş Noktası Seç

# pathLength
source: Path Length: {steps} steps
tr: Yol Uzunluğu: {steps} adım

# noPathFound
source: No path found between the selected points
tr: Seçilen noktalar arasında yol bulunamadı

# pathCalculationError
source: Error calculating path
tr: Yol hesaplanırken hata oluştu

# gridSize
source: Grid Size: {rows}Ã—{cols}
tr: Izgara Boyutu: {rows}×{cols}

# totalItems
source: Total Items: {count}
tr: Toplam Öğe: {count}

source: Calculating...
tr: Hesaplanıyor...

source: Go!
tr: Git!

# selectPoint
source: Select {title}
tr: {title} Seç

# positionAt
source: Position: ({row}, {col})
tr: Konum: ({row}, {col})

source: Navigation Path
tr: Navigasyon Yolu

# totalSteps
source: Total steps: {count}
tr: Toplam adım: {count}

source: Step-by-step directions:
tr: Adım adım yönergeler:

# tapSpeakerToHearInstructions
source: Tap the speaker button to hear navigation instructions
tr: Navigasyon talimatlarını duymak için hoparlör düğmesine dokunun

# ttsNotAvailableTapButtonToShowInstructions
source: TTS not available. Tap the button below to show instructions.
tr: TTS mevcut değil. Talimatları göstermek için aşağıdaki düğmeye dokunun.

source: Retry TTS
tr: TTS'yi Tekrar Dene

source: Speak Navigation Instructions
tr: Navigasyon Talimatlarını Seslendir

source: Show Navigation Instructions
tr: Navigasyon Talimatlarını Göster

source: Navigation
tr: Navigasyon
